товары = [
    # название, вес, количество, цена, категория
    ['Гиря 40', 40, 0, 50, 'спорт'],
    ['Гиря 16', 16, 7, 40, 'спорт'],
    ['Гиря 16', 16, 7, 40, 'спорт'],
    ['Гиря 32', 32, 3, 60, 'спорт'],
    ['Турник потолковый', 3, 18, 100, 'спорт'],
    ['Турник напольный', 70, 8, 200, 'спорт'],
    ['Турник напольный хиленький', 35, 2, 120, 'спорт'],
    ['Ашанбайк', 24, 20, 241, 'спорт'],
    ['Самокат', 5, 23, 198, 'спорт'],
    ['Телефон Самсунг Галакси с8', 0.300, 23, 500, 'электроника'],
    ['Ноутбук Делл 15 дюймов v322', 3.2, 31, 3000, 'электроника'],
    ['Монитор 23 дюйма делл с классной подставкой', 3.2, 31, 203, 'электроника'],
    ['Повербанка', 0.450, 35, 18, 'электроника'],
    ['Дирижабль', 7000, 1, 7_000_000, 'транспорт'],
    ['Космический Шаттл', 880_000, 1, 2_000_000_000, 'транспорт'],
    ['Бетмобиль', 3000, 0, 12_000_000, 'транспорт'],
]

for товар in товары:
    if товар[-1] == 'транспорт':
        print(товар[0])
