слово = input('Введите слово для проверки: ')

# if слово[0] == слово[-1] and слово[1] == слово[-2]:
#     print('ПАЛИНДРОМ, УСПЕХ')

длина_слова = len(слово)
print('Длина слова: ' + str(длина_слова))
палиндром = True
for i in range(длина_слова):
    буква = слово[i]
    индекс_в_конце = длина_слова - i - 1
    буква_в_конце = слово[индекс_в_конце]
    print('Проверяем', i, индекс_в_конце, буква, буква_в_конце)
    if буква != буква_в_конце:
        палиндром = False
        break

if палиндром:
    print('ПАЛИНДРОМ, УСПЕХ')

